cities = ['서울', '부산', '인천', '대구', '대전', '광주', '울산', '수원']
print(cities[0:4]) # 끝 숫자는 포함하지 않는다
# ['서울', '부산', '인천', '대구']
print(cities[5:])
# ['광주', '울산', '수원']

print(cities[-8:])
# ['서울', '부산', '인천', '대구', '대전', '광주', '울산', '수원']
print(cities[:])
# ['서울', '부산', '인천', '대구', '대전', '광주', '울산', '수원']
print(cities[-50:4])
# ['서울', '부산', '인천', '대구']
print(cities[::2])
# ['서울', '인천', '대전', '울산']
print(cities[1:7:2])
# ['부산', '대구', '광주']
print(cities[::-1])
# ['수원', '울산', '광주', '대전', '대구', '인천', '부산', '서울']

